# HasBinding Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RevitCommandId..::..HasBinding Property
RevitCommandId Class See Also
---
Indicates whether a replacement of either the Execute or CanExecute events (or both) have been applied to this command.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool HasBinding { get; }
```

Visual Basic
---
```text
Public ReadOnly Property HasBinding As Boolean
	Get
```

Visual C++
---
```text
public:
property bool HasBinding {
	bool get ();
}
```

# Remarks
This will not indicate if one or more applications have subscribed to the BeforeExecuted event, as this event is not limited to a single subscriber.
# See Also
RevitCommandId Class
Autodesk.Revit.UI Namespace